import React from "react";

function Filter2() {
  const arr1 = [1, 2, 3, 4, 5];
  // 를 활용하여
  // const newArr1 = [1, 4, 9, 16, 25];
  // 를 만들어보자.

  ///////////////////////////////////////////////////////////////////////////////////////

  const arr2 = ["1", "2", "3", "4", "5"];
  // 를 활용하여
  const newArr2 = [1, 2, 3, 4, 5];
  // 를 만들어보자.
  // parseInt

  ///////////////////////////////////////////////////////////////////////////////////////

  const arr3 = [
    {
      name: "jun",
      age: 18,
    },
    {
      name: "alex",
      age: 28,
    },
    {
      name: "ken",
      age: 38,
    },
  ];
  // 를 활용하여
  const newArr3 = [18, 28, 38];
  // 를 만들어보자.

  ///////////////////////////////////////////////////////////////////////////////////////

  const arr4 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
  // 를 활용하여
  // 짝수만 들어있는 array를 만들어보자.

  // 짝수이면서 5이상인 숫자만 들어있는 array를 만들어보자.

  ///////////////////////////////////////////////////////////////////////////////////////

  const arr5 = [
    {
      name: "jun",
      age: 18,
    },
    {
      name: "alex",
      age: 28,
    },
    {
      name: "ken",
      age: 38,
    },
    {
      name: "beemo",
      age: 48,
    },
    {
      name: "lynda",
      age: 8,
    },
  ];
  // 를 활용하여
  // age가 30 이하인 사람들의 정보가 담긴 array를 만들어보자.

  // 를 활용하여
  // age가 30 이하인 사람들의 이름이 담긴 array를 만들어보자.

  const newArr1 = [];
  const arritem = arr1.map((num) => newArr1.push(num * num));

  return (
    <div>
      <ul>{newArr1}</ul>
    </div>
  );
}

export default Filter2;
